# Example Project Notebook

## Imports

### *Library imports*

In [1]:
import os
import pandas as pd
import sys

### *Custom function imports from src*

In [2]:
sys.path.append(os.path.abspath('../src'))

from main import df_column_combos
from utils import all_column_combos

## Data Processing

### *Data Import + Tidying*

In [3]:
stineman_siblings = pd.read_csv('../data/stineman_siblings.csv')
stineman_siblings

        name   birthdate  height_inches
0  Alexandra   5/12/2011          68.00
1     Nathan   3/20/2009          71.50
2      Sarah    4/8/2006          71.00
3   Nicholas   8/27/2000          74.00
4     Andrew  10/21/1997          76.75

In [4]:
stineman_siblings['birthdate'] = pd.to_datetime(stineman_siblings['birthdate'], utc = True)
stineman_siblings

        name                 birthdate  height_inches
0  Alexandra 2011-05-12 00:00:00+00:00          68.00
1     Nathan 2009-03-20 00:00:00+00:00          71.50
2      Sarah 2006-04-08 00:00:00+00:00          71.00
3   Nicholas 2000-08-27 00:00:00+00:00          74.00
4     Andrew 1997-10-21 00:00:00+00:00          76.75

## Analysis

### *Unique Column Combos*

In [5]:
df_column_combos(stineman_siblings)

[(0,), (1,), (2,), (0, 1), (0, 2), (1, 2), (0, 1, 2)]

In [6]:
all_column_combos(stineman_siblings)

[('name',),
 ('birthdate',),
 ('height_inches',),
 ('name', 'birthdate'),
 ('name', 'height_inches'),
 ('birthdate', 'height_inches'),
 ('name', 'birthdate', 'height_inches')]

*Note how we can import + use functions from both utils.py (independent) and main.py (imports from utils)*